freetronics/ATmega2561BoardProfile/boards.txt
ardusat.name=ArduSat Supervisor Module

ardusat.upload.protocol=wiring
ardusat.upload.maximum_size=258048
ardusat.upload.speed=115200

ardusat.bootloader.low_fuses=0xFF
ardusat.bootloader.high_fuses=0xD8
ardusat.bootloader.extended_fuses=0xFD
ardusat.bootloader.path=stk500v2
ardusat.bootloader.file=stk500boot_v2_mega2560.hex
ardusat.bootloader.unlock_bits=0x3F
ardusat.bootloader.lock_bits=0x0F

ardusat.build.mcu=atmega2561
ardusat.build.f_cpu=16000000L
ardusat.build.core=arduino:arduino
ardusat.build.variant=mega
